import { CommonModule } from '@angular/common';
import { Component, ViewEncapsulation } from '@angular/core';
import { NavigationComponent } from '../../shared/navigation/navigation.component';
import { FooterComponent } from '../../shared/footer/footer.component';

@Component({
  selector: 'app-data-analysis',
  standalone: true,
  imports: [CommonModule, NavigationComponent, FooterComponent],
  templateUrl: './data-analysis.component.html',
  encapsulation: ViewEncapsulation.None,
})
export class DataAnalysisComponent {
  list: { title: string; desc: string; isOpen: boolean }[] = [
    {
      title: 'محصول شما چه خدماتی ارائه می‌دهد؟',
      desc: 'ارائه داشبوردها و گزارشات تحلیلی متنوع از قبیل وضعیت های مختلف پرداخت ها، جزئیات تراکنش ها، بررسی لحظه‌ای گردش مالی حساب ها، تحلیل مانده رسوب، کارمزدها و ....',
      isOpen: false,
    },
    {
      title: 'چگونه می‌توانم با تیم پشتیبانی تماس بگیرم؟',
      desc: 'امکان ارسال تیکت در سامانه iBpay فراهم شده است. هر گونه سوال، ابهام و یا مشکلی در سامانه به وجود آید، از طریق ارسال تیکت، تیم پشتیبانی در سریعترین زمان ممکن پاسخگوی شما خواهد بود.',
      isOpen: false,
    },
    {
      title:
        'چگونه می‌توانم از این محصول برای بهبود عملکرد سرمایه‌گذاری خود استفاده کنم؟',
      desc: 'با بررسی لحظه ای گردش مالی حساب ها و همچنین با ارائه داشبورد دارایی های تحت مدیریت سازمان شما می‌توانید تصمیمات سرمایه گذاری خود را بهبود بخشید.',
      isOpen: false,
    },
    {
      title: 'آیا امکان همکاری با دیگر کاربران در این محصول وجود دارد؟',
      desc: 'با توجه به تعیین سطوح دسترسی در سامانه، امکان تعریف هرگونه تعامل میان کاربران فراهم می باشد.',
      isOpen: false,
    },
    {
      title: 'آیا می‌توانم از این محصول برای مدیریت ریسک استفاده کنم؟',
      desc: 'با گزارشات فعالیت حساب، دارایی، معاملات، تحلیل هزینه ها، سودآوری و همچنین KPIهای تعریف شده از سوی سازمان شما، عملا یک نمایه 360 درجه برای مدیریت ریسک ارائه می‌گردد.',
      isOpen: false,
    },
    {
      title: 'آیا محصول شما با قوانین و مقررات مالی سازگار است؟',
      desc: 'محصول بر اساس استانداردهای تعریف شده در صنعت مالی توسعه گردیده است.',
      isOpen: false,
    },
    {
      title:
        'آیا می‌توانم از این محصول برای تجزیه و تحلیل عملکرد بازار استفاده کنم؟',
      desc: 'با راه اندازی دریاچه داده در شرکت هوشمند ریسک ارائه هر گونه گزارشات تحلیلی و هوشمند برای تجزیه و تحلیل عملکرد بازار وجود دارد.',
      isOpen: false,
    },
    {
      title: 'آیا محصول شما قابلیت تحلیل داده‌های بازار در زمان واقعی دارد؟',
      desc: 'به منظور تحلیل داده های بازار به صورت بلادرنگ، سعی شده است که داده ها با کم ترین زمان تاخیر نسبت به بازار لحظه ای به مشتریان ارائه گردد.',
      isOpen: false,
    },
    {
      title: 'چگونه می‌توانم از امکانات تجزیه و تحلیل پیشرفته استفاده کنم؟',
      desc: 'با توسعه پلتفرم پردازش داده، امکان سرویس دهی به مشتریان جهت ساخت گزارشات پیشرفته توسط خود آنها، فراهم گردیده است.',
      isOpen: false,
    },
    {
      title: 'چگونه می‌توانم داده‌های مالی را در محصول شما وارد کنم؟',
      desc: 'راه های مختلفی برای دسترسی به داده ها سازمان شما فراهم شده است. از طریق api، اتصال به دیتابیس، بارگذاری فایل و ....',
      isOpen: false,
    },
  ];
}
